# GetNonContinuousRailCount Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
NonContinuousRailStructure..::..GetNonContinuousRailCount Method
NonContinuousRailStructure Class See Also
---
Gets number of Non-Continuous Rails.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public int GetNonContinuousRailCount()
```

Visual Basic
---
```text
Public Function GetNonContinuousRailCount As Integer
```

Visual C++
---
```text
public:
int GetNonContinuousRailCount()
```

# ### Return Value
Count of Non-Continuous Rails.
# See Also
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace